//指针引用多维数组
//输出多维数组有关数据

#include "stdio.h"
int main()
	{
		int a[3][4]={1,2,3,4,5,6,7,8,9,10,11,12};     //a[0][0]~~a[2][3] 
		printf("%d %d %d\n", a , a[0] , a[0][0]);     //0行首地址   0行0列元素地址   0行0列元素的值 
		printf("%d %d %d\n", a , *a , *(*a));
		printf("%d %d %d\n", &a[0] , a[0] , *a[0]);
		printf("%d %d %d\n", &a[0], &a[0][0] , a[0][0]); 
		printf("\n");
		
		printf("%d %d %d\n", a+2 , a[2]+1 , a[2][1]);     //2行首地址   2行1列元素地址   2行1列元素的值 
		printf("%d %d %d\n", a+2 , *(a+2)+1 , *(*(a+2)+1));
		printf("%d %d %d\n", &a[2] , a[2]+1 , *(a[2]+1));
		printf("%d %d %d\n", &a[2], &a[2][1] , a[2][1]); 
 
 
		
		   
		
	} 

 
 
